app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(id: :desc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC, "tasks"."desc" ASC