app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" DESC

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("text", "aasm_state", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "lorem ipsum set dollor set amet"], ["aasm_state", "uncompleted"], ["created_at", 2017-02-08 07:20:07 UTC], ["updated_at", 2017-02-08 07:20:07 UTC]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "text" = $1, "aasm_state" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["text", "lorem ipsum set dollor set ame - Completed"], ["aasm_state", "completed"], ["updated_at", 2017-02-08 08:21:05 UTC], ["id", 1]]